<h1><font face='Calibri' color="#001A56" size=+3.5><b>
    Projeto 02: Pontuação de crédito
    </b></font></h1>
    
<h3><font face='Calibri' color="#001A56" size=+1.5>
    Bootcamp em análise de dados, Practicum by Yandex.
    </font></h3>
    
<hr>

<font face='Calibri' color="#001A56" size=+0.8>
    Na segunda <i>sprint</i> aprendemos a avaliar a qualidade dos dados e se ela é alta o suficiente para testar hipóteses. Aprendemos como identificar e processar dados duplicados, dados ausentes, diferentes tipos de dados e a categorizar dados. Esse é o projeto de conclusão da <i>sprint</i> 02.
    </font>

<hr>

<a id='back'></a>
<h2><font face='Calibri' color="#001A56" size=+3.0>
    Índice.
    </font></h2>

<font face='Calibri' color="#001A56" size=+0.8>
    
- [Introdução](#intro)
    - [Objetivos](#obj)
    - [Dados](#dados)
* [Etapa 1. Visão geral dos dados](#data_review)
* [Etapa 2. Pré-processamento de dados](#data_preprocessing)
    * [Analisando os valores ausentes.](#ausentes)
    * [Analisando os dados da coluna education.](#education)
    * [Analisando os dados da coluna children.](#children)
    * [Analisando os dados da coluna dob_years.](#dob_years)
    * [Analisando os dados da coluna family_status.](#family)
    * [Analisando os dados da coluna gender.](#gender)
    * [Analisando os dados da coluna income_type.](#income_type)
    * [Verificando a presença de dados duplicados.](#duplicados)
    * [Tratando os valores ausentes.](#Tausentes)
    * [Categorização de dados.](#categorias)
* [Etapa 3. Verificando as hipóteses](#hypotheses)
    * [Hipótese 1: Existe uma correlação entre o nível de renda e do pagamento em dia?](#h1)
        * [Conclusões](#h1_conclusao)
    * [Hipótese 2: Existe uma correlação entre o status familiar e o pagamento em dia?](#h2)
        * [Conclusões](#h2_conclusao)
    * [Hipótese 3: Existe uma correlação entre o número de crianças e o pagamento em dia?](#h3)
        * [Conclusões](#h3_conclusao)
    * [Hipótese 4: Como a finalidade do crédito afeta a taxa de inadimplência?](#h4)
        * [Conclusões](#h4_conclusao)
    * [Hipótese 5: Existe uma correlação entre a educação e o pagamento em dia?](#h5)
        * [Conclusões](#h5_conclusao)
* [Conclusão](#end)
* [Fontes](#fontes)
* [Contatos](#contato)   
 <hr>

<a id='intro'></a>
<h2><font face='Calibri' color="#001A56" size=+3.0>
    Introdução
    </font></h2> 
     <p>    
<font face='Calibri' color="#001A56" size=+0.8>
Nesse projeto iremos preparar um relatório para a divisão de empréstimos de um banco. Iremos descobrir informações como, se o estado civil de um cliente e o número de filhos têm impacto sobre a inadimplência de um empréstimo. O banco já tem alguns dados sobre a capacidade de crédito dos clientes.
Nosso trabalho é criar uma pontuação de crédito de um cliente em potencial. Uma pontuação de crédito é usada para avaliar a capacidade de um devedor em potencial pagar seu empréstimo.
    </font>    
   
    
<a id='obj'></a>    
<h3><font face='Calibri' color="#013294" size=+2.0>
    Objetivos
    </font></h3>
    <p>
    <font face='Calibri' color="#001A56" size=+0.8>
    Durante esse projeto analisaremos as seguintes hipoteses:
     
<ol>
<li> Existe uma correlação entre o nível de renda e o pagamento em dia?
<li> Existe uma correlação entre o status familiar e o pagamento em dia? 
<li> Existe uma correlação entre a quantidade de crianças e o pagamento em dia?
<li> Como a finalidade do crédito afeta a taxa de inadimplência?
<li> Existe uma correlação entre a educação e o pagamento em dia?      
    </ol></font>

    
    
<a id='dados'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
    Dados
    </font></h3>
    <p>
<font face='Calibri' color="#001A56" size=+0.8>    
Os dados sobre a capacidade de crédito dos clientes estão armazenados no arquivo <code>credit_scoring_eng.csv</code>. Inicialmente não temos informações sobre a qualidade dos dados apenas as descrições da colunas, que são:
    <ul>
    <li><coder>children</coder>: o número de crianças na família.
    <li><coder>days_employed</coder>: quanto tempo o cliente trabalhou.
    <li><coder>dob_years</coder>: a idade do cliente.
    <li><coder>education</coder>: o nível de educação do cliente.
    <li><coder>education_id</coder>: identificador da educação do cliente.
    <li><coder>family_status</coder>: estado civil do cliente.
    <li><coder>family_status_id</coder>: identificador do estado civil do cliente.
    <li><coder>gender</coder>: o sexo do cliente.
    <li><coder>income_type</coder>: o tipo de renda do cliente.
    <li><coder>debt</coder>: se o cliente já deixou de pagar um empréstimo.
    <li><coder>total_income</coder>: renda mensal.
    <li><coder>purpose</coder>: motivo para fazer um empréstimo.
    </ul>
<p>

    
[Voltar ao Índice](#back)
    
<hr>

<h2><font face='Calibri' color="#001A56" size=+3.0>
Etapa 1. Visão geral dos dados
    </font></h2><a id='data_review'></a>
<p>
<font face='Calibri' color="#001A56" size=+0.8>
Importaremos os dados sobre a capacidade de crédito dos clientes presentes no arquivo <code>credit_scoring_eng.csv</code>. Para isso precisaremos da biblioteca Pandas que também será importada.

In [1]:
# Importando bibliotecas
import pandas as pd

In [2]:
# Importando os dados
df = pd.read_csv('credit_scoring_eng.csv')

# Exibindo as informações da tabela
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [3]:
# Exibindo as primeiras linhas da tabela
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding

In [4]:
df.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,19351.000000
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,26787.568355
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,16475.450632
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,3306.762000
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,16488.504500
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,23202.870000
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,32549.611000
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,362496.645000

<font face='Calibri' color="#001A56" size=+0.8>
Existem vários problemas com os dados recebidos, entre eles:
    <ul>
        <li><code>days_employed</code>: dados do tipo <b>float</b>, o ideal seria altera-los para <b>int</b>. Ainda nessa coluna vemos números negativos e positivos, o ideal seria saber o motivo dessa divergência, inicialmente parece que números positivos estão ligados aos aposentados. Possui valores ausentes.
    <li><code>education</code>: as descrições de educação estão todas iguais, porém em alguns casos foram utilizadas letras maiúsculas enquanto em outros apenas minúsculas, será necessário alterar para que fiquem todas escritas somente com letras minúsculas.
    <li><code>education_id</code>: aparentemente essa coluna tem a mesma função da coluna education, categorizar o nível de educação.
    <li><code>family_status</code> e <code>family_status_id</code>: aparentemente essas colunas possuem a mesma função, fornecem a mesma informação.
    <li><code>total_income</code>: Possui valores ausentes.
    <li><code>purpose</code>: As descrições são longas e diferentes mesmo quando são assuntos semelhantes, o ideal seria categoriza-las de formas mais concisa.
    
[Voltar ao Índice](#back)
    
<hr>

<a id='data_preprocessing'></a>
<h2><font face='Calibri' color="#001A56" size=+3.0>
Etapa 2. Pré-processamento de dados
    </font></h2>
<p>
<font face='Calibri' color="#001A56" size=+0.8> 
Nessa etapa iremos análisar os problemas acima relatados e tratá-los caso seja possível.

<a id='ausentes'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Analisando os valores ausentes. 
    </font></h3>
<p>
<font face='Calibri' color="#001A56" size=+0.8> 
Primeiramente iremos analisar se o valores ausentes são simétricos.

In [5]:
# Somando os valores ausentes.
df.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

In [6]:
# Filtrando os valores ausentes pela colunas days_employed
missing = df[df['days_employed'].isna()]

# Somando os valores ausentes da coluna total_income dos dados filtrados
missing['total_income'].isna().sum()

2174

<font face='Calibri' color="#001A56" size=+0.8> 
Primeiro filtrei em uma nova variável (<code>missing</code>) todas as linhas com valores ausentes na coluna <b>days_employed</b> e depois realizei a contagem de valores ausentes na coluna <b>total_income</b> da tabela filtrada e a contagem de valores ausentes foram iguais (2174), ou seja, os valores ausentes são simétricos, o que pode indicar que essas informações possuem relação.


Irei verificar a distribuição dos valores ausentes em relação as outras informações dos clientes na tentativa de identificar algum padrão ou algo que justifique os valores ausentes. Ou então se há alguma tendência que deva ser levada em consideração quando for realizar os calculos para preenchimento dos valores ausentes.

In [7]:
df.isna().sum() / df.count() * 100

children             0.000000
days_employed       11.234562
dob_years            0.000000
education            0.000000
education_id         0.000000
family_status        0.000000
family_status_id     0.000000
gender               0.000000
income_type          0.000000
debt                 0.000000
total_income        11.234562
purpose              0.000000
dtype: float64

<font face='Calibri' color="#001A56" size=+0.8> 
11,23% dos dados possuem valores ausentes.

In [8]:
missing['income_type'].value_counts(normalize=True)

employee         0.508280
business         0.233671
retiree          0.189972
civil servant    0.067617
entrepreneur     0.000460
Name: income_type, dtype: float64

In [9]:
missing['income_type'].value_counts() / df['income_type'].value_counts()

business                       0.099902
civil servant                  0.100754
employee                       0.099379
entrepreneur                   0.500000
paternity / maternity leave         NaN
retiree                        0.107106
student                             NaN
unemployed                          NaN
Name: income_type, dtype: float64

In [10]:
df['income_type'].value_counts()

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
student                            1
paternity / maternity leave        1
Name: income_type, dtype: int64

In [11]:
missing['education'].value_counts(normalize=True)

secondary education    0.647654
bachelor's degree      0.228151
SECONDARY EDUCATION    0.030819
Secondary Education    0.029899
some college           0.025299
Bachelor's Degree      0.011500
BACHELOR'S DEGREE      0.010580
primary education      0.008740
Some College           0.003220
SOME COLLEGE           0.003220
Primary Education      0.000460
PRIMARY EDUCATION      0.000460
Name: education, dtype: float64

In [12]:
missing['education'].value_counts() / df['education'].value_counts()

BACHELOR'S DEGREE      0.083942
Bachelor's Degree      0.093284
GRADUATE DEGREE             NaN
Graduate Degree             NaN
PRIMARY EDUCATION      0.058824
Primary Education      0.066667
SECONDARY EDUCATION    0.086788
SOME COLLEGE           0.241379
Secondary Education    0.091421
Some College           0.148936
bachelor's degree      0.105129
graduate degree             NaN
primary education      0.076000
secondary education    0.102400
some college           0.082335
Name: education, dtype: float64

In [13]:
missing['gender'].value_counts(normalize=True)

F    0.682613
M    0.317387
Name: gender, dtype: float64

In [14]:
missing['gender'].value_counts() / df['gender'].value_counts()

F      0.104243
M      0.094676
XNA         NaN
Name: gender, dtype: float64

In [15]:
missing['family_status'].value_counts(normalize=True)

married              0.568997
civil partnership    0.203312
unmarried            0.132475
divorced             0.051518
widow / widower      0.043698
Name: family_status, dtype: float64

In [16]:
missing['family_status'].value_counts() / df['family_status'].value_counts()

married              0.099919
civil partnership    0.105818
unmarried            0.102382
divorced             0.093724
widow / widower      0.098958
Name: family_status, dtype: float64

In [17]:
missing['children'].value_counts(normalize=True)

 0     0.661914
 1     0.218491
 2     0.093836
 3     0.016559
 20    0.004140
 4     0.003220
-1     0.001380
 5     0.000460
Name: children, dtype: float64

In [18]:
missing['children'].value_counts() / df['children'].value_counts()

-1     0.063830
 0     0.101703
 1     0.098589
 2     0.099270
 3     0.109091
 4     0.170732
 5     0.111111
 20    0.118421
Name: children, dtype: float64

<font face='Calibri' color="#001A56" size=+0.8> 
Não encontramos até o momento nenhum indicio que as demais informações dos clientes posssam estar relacionadas com os valores ausentes. Também notamos que os valores ausentes não estão distribuidos de maneira uniforme entre todas as descrições das demais características como educação e emprego, e que provavelmente isso deverá ser levado em conta na hora de calcularmos os valores substitutos.
<br>  
<p>
Não há um motivo explícito para os valores ausentes nos dados, aparentemente os valores parecem ser aleatórios, pelo menos não conseguimos encontrar nenhuma relação com outra informação até o momento. Acreditamos que exista uma relação, mas que seja justamente entre <b>days_employed</b> e <b>total_income</b>, justificando que os valores ausentes sejam simétricos.
    
<p>
Analisaremos agora a distribuição dos valores ausentes no DataFrame completo e copararemos com os dados filtrados em <code>missing</code>

In [19]:
# Salvando uma cópia dos dados originais
copy = df

# Preenchedo os valores ousentes
copy = copy.fillna('unknow')

# Criando uma função para atribuir números aos dados com valores ausentes
def ausencias(total_income):
    if total_income == 'unknow':
        return 1
    else:
        return 0

# Criando uma coluna com a informação de dados ausentes.
copy['ausentes'] = copy['total_income'].apply(ausencias)

In [20]:
# Criando uma tabela com a informação de dados ausentes conforme a educação e tipo da renda.
copy.pivot_table(index='income_type', columns='education_id', values='ausentes',  aggfunc='sum', margins=True)

education_id                     0       1     2     3    4   All
income_type
business                     188.0   299.0  20.0   1.0  NaN   508
civil servant                 62.0    77.0   6.0   2.0  0.0   147
employee                     236.0   820.0  37.0  12.0  0.0  1105
entrepreneur                   1.0     NaN   NaN   NaN  NaN     1
paternity / maternity leave    NaN     0.0   NaN   NaN  NaN     0
retiree                       57.0   344.0   6.0   6.0  0.0   413
student                        0.0     NaN   NaN   NaN  NaN     0
unemployed                     0.0     0.0   NaN   NaN  NaN     0
All                          544.0  1540.0  69.0  21.0  0.0  2174

In [21]:
# Criando uma tabela com a informação de dados ausentes conforme o gênero e status familiar.
copy.pivot_table(index='gender', columns='family_status', values='ausentes',  aggfunc='sum', margins=True)

family_status,civil partnership,divorced,married,unmarried,widow / widower,All
gender,,,,,,
F,309.0,93.0,800.0,192.0,90.0,1484
M,133.0,19.0,437.0,96.0,5.0,690
XNA,0.0,NaN,NaN,NaN,NaN,0
All,442.0,112.0,1237.0,288.0,95.0,2174

In [22]:
df['income_type'].value_counts(normalize=True)

employee                       0.516562
business                       0.236237
retiree                        0.179141
civil servant                  0.067782
unemployed                     0.000093
entrepreneur                   0.000093
student                        0.000046
paternity / maternity leave    0.000046
Name: income_type, dtype: float64

In [23]:
missing['income_type'].value_counts(normalize=True)

employee         0.508280
business         0.233671
retiree          0.189972
civil servant    0.067617
entrepreneur     0.000460
Name: income_type, dtype: float64

In [24]:
df['education'].value_counts(normalize=True)

secondary education    0.638792
bachelor's degree      0.219187
SECONDARY EDUCATION    0.035865
Secondary Education    0.033031
some college           0.031034
BACHELOR'S DEGREE      0.012729
Bachelor's Degree      0.012451
primary education      0.011614
Some College           0.002184
SOME COLLEGE           0.001347
PRIMARY EDUCATION      0.000790
Primary Education      0.000697
graduate degree        0.000186
Graduate Degree        0.000046
GRADUATE DEGREE        0.000046
Name: education, dtype: float64

In [25]:
missing['education'].value_counts(normalize=True)

secondary education    0.647654
bachelor's degree      0.228151
SECONDARY EDUCATION    0.030819
Secondary Education    0.029899
some college           0.025299
Bachelor's Degree      0.011500
BACHELOR'S DEGREE      0.010580
primary education      0.008740
Some College           0.003220
SOME COLLEGE           0.003220
Primary Education      0.000460
PRIMARY EDUCATION      0.000460
Name: education, dtype: float64

In [26]:
df['gender'].value_counts(normalize=True)

F      0.661370
M      0.338583
XNA    0.000046
Name: gender, dtype: float64

In [27]:
missing['gender'].value_counts(normalize=True)

F    0.682613
M    0.317387
Name: gender, dtype: float64

In [28]:
df['family_status'].value_counts(normalize=True)

married              0.575145
civil partnership    0.194053
unmarried            0.130685
divorced             0.055517
widow / widower      0.044599
Name: family_status, dtype: float64

In [29]:
missing['family_status'].value_counts(normalize=True)

married              0.568997
civil partnership    0.203312
unmarried            0.132475
divorced             0.051518
widow / widower      0.043698
Name: family_status, dtype: float64

In [30]:
df['dob_years'].sort_values(ascending=True).value_counts(normalize=True)

35    0.028664
40    0.028293
41    0.028200
34    0.028014
38    0.027782
42    0.027735
33    0.026992
39    0.026620
31    0.026016
36    0.025784
44    0.025412
29    0.025319
30    0.025087
48    0.024994
37    0.024948
50    0.023879
43    0.023833
32    0.023693
49    0.023600
28    0.023368
45    0.023089
27    0.022904
56    0.022625
52    0.022485
47    0.022300
54    0.022253
46    0.022067
58    0.021417
57    0.021370
53    0.021324
51    0.020813
59    0.020627
55    0.020581
26    0.018955
60    0.017515
25    0.016585
61    0.016492
62    0.016353
63    0.012497
64    0.012311
24    0.012265
23    0.011800
65    0.009013
22    0.008502
66    0.008502
67    0.007758
21    0.005157
0     0.004692
68    0.004599
69    0.003949
70    0.003020
71    0.002695
20    0.002369
72    0.001533
19    0.000650
73    0.000372
74    0.000279
75    0.000046
Name: dob_years, dtype: float64

In [31]:
missing['dob_years'].sort_values(ascending=True).value_counts(normalize=True)

34    0.031739
40    0.030359
31    0.029899
42    0.029899
35    0.029439
36    0.028979
47    0.027139
41    0.027139
30    0.026679
28    0.026219
58    0.025759
57    0.025759
54    0.025299
38    0.024839
56    0.024839
52    0.024379
37    0.024379
33    0.023459
50    0.023459
39    0.023459
51    0.022999
49    0.022999
45    0.022999
29    0.022999
43    0.022999
55    0.022079
46    0.022079
48    0.021159
44    0.020239
53    0.020239
60    0.017939
62    0.017479
61    0.017479
64    0.017019
32    0.017019
27    0.016559
23    0.016559
26    0.016099
59    0.015639
63    0.013339
25    0.010580
24    0.009660
66    0.009200
65    0.009200
21    0.008280
22    0.007820
67    0.007360
0     0.004600
68    0.004140
20    0.002300
69    0.002300
71    0.002300
70    0.001380
72    0.000920
19    0.000460
73    0.000460
Name: dob_years, dtype: float64

<font face='Calibri' color="#001A56" size=+0.8> 
As distribuiçãos em ambos os conjuntos são semelhantes, por isso consideramos os dados ausentes como aleatórios.
    
Não encontramos nenhum padrão que possa explicar os dados ausentes, pois esses dados estão presentes em quase todas as categorias das demais colunas, dessa forma não havendo nenhuma correlação direta com outra informação do cliente.

Antes de tratar os valores ausentes iremos analisar os dados isolados de cada coluna para tratar possíveis erros presentes, feito isso, iremos verificar a variação dos valores conforme outras caracteristicas dos clientes, como educação e emprego. E por último analisaremos qual a melhor forma de preencher esses valores, com a média ou mediana, e se os valores serão relacionados a outras caracteristicas.
    
[Voltar ao Índice](#back)

<a id='education'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Analisando os dados da coluna <b>education</b>.
    </font></h3>
<p>
<font face='Calibri' color="#001A56" size=+0.8> 
Analisaremos agora as informações da coluna <b>education</b>, pelo oque foi possível observar nas etapas anteriores temos informações iguais porém escritas de formas diferentes, vejamos:

In [32]:
# Exibindo os resulados unívocos da coluna education.
df['education'].unique()

array(["bachelor's degree", 'secondary education', 'Secondary Education',
       'SECONDARY EDUCATION', "BACHELOR'S DEGREE", 'some college',
       'primary education', "Bachelor's Degree", 'SOME COLLEGE',
       'Some College', 'PRIMARY EDUCATION', 'Primary Education',
       'Graduate Degree', 'GRADUATE DEGREE', 'graduate degree'],
      dtype=object)

In [33]:
# Alterando todos os resultados para letras minúsculas
df['education'] = df['education'].str.lower()

# Exibindo os resulados unívocos da coluna education após alteração.
df['education'].unique()

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

In [34]:
df['education'].value_counts(normalize=True)

secondary education    0.707689
bachelor's degree      0.244367
some college           0.034564
primary education      0.013101
graduate degree        0.000279
Name: education, dtype: float64

In [35]:
df['education'].value_counts()

secondary education    15233
bachelor's degree       5260
some college             744
primary education        282
graduate degree            6
Name: education, dtype: int64

<font face='Calibri' color="#001A56" size=+0.8>
Os dados foram corrigidos, agora temos apenas 5 resultados possíveis para a coluna <b>education</b>.
    
[Voltar ao Índice](#back)

<a id='children'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Analisando os dados da coluna children.
</font></h3>
<p>
<font face='Calibri' color="#001A56" size=+0.8>
    Analisaremos agora os dados da coluna children.

In [36]:
# Quantidade de valores da coluna
df['children'].value_counts(normalize=True)

 0     0.657329
 1     0.223833
 2     0.095470
 3     0.015331
 20    0.003531
-1     0.002184
 4     0.001905
 5     0.000418
Name: children, dtype: float64

<font face='Calibri' color="#001A56" size=+0.8>
Há dois tipos de dados com erros. O primeiro são os com valores -1 (0,21%), pois é impossível alguém ter 1 filho negativo, e o segundo são com valores 20  (0,35%), sabemos que atualmente as familias não são mais tão grandes como antigamente e com 20 filhos seria quase impossível.

Acredito que ambos casos tenham sidos erros de digitação, provavelmente essas pessoas tinham a intenção de digitar 1 e 2, que são valores mais realistas para essa informação, como podemos ver pelos demais dados da coluna.

Por acreditar que esses são erros de digitação e por representarem uma quantidade muito pequena de dados, aproximadamente 0,56%, eu irei corrigir esses valores para 1 e 2.

In [37]:
# Subistituindo os resultados 20 por 2.
df['children'] = df['children'].replace(20,2)

# Subistituindo os resultados -1 por 1.
df['children'] = df['children'].replace(-1,1)

# Quantidade de valores da coluna
df['children'].value_counts(normalize=True)

0    0.657329
1    0.226016
2    0.099001
3    0.015331
4    0.001905
5    0.000418
Name: children, dtype: float64

<font face='Calibri' color="#001A56" size=+0.8>
Os valores foram subistiuidos e não alteraram significativamente as proporções dos demais dados.

<a id='days_employed'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Analisando os dados da coluna days_employed.
</font></h3>
<p>
<font face='Calibri' color="#001A56" size=+0.8>

In [38]:
df['days_employed'].describe()

count     19351.000000
mean      63046.497661
std      140827.311974
min      -18388.949901
25%       -2747.423625
50%       -1203.369529
75%        -291.095954
max      401755.400475
Name: days_employed, dtype: float64

In [39]:
df[df['days_employed'] <= 0].count() / df.count()

children            0.738955
days_employed       0.821973
dob_years           0.738955
education           0.738955
education_id        0.738955
family_status       0.738955
family_status_id    0.738955
gender              0.738955
income_type         0.738955
debt                0.738955
total_income        0.821973
purpose             0.738955
dtype: float64

In [40]:
df[df['days_employed'] < 0].count()

children            15906
days_employed       15906
dob_years           15906
education           15906
education_id        15906
family_status       15906
family_status_id    15906
gender              15906
income_type         15906
debt                15906
total_income        15906
purpose             15906
dtype: int64

In [41]:
df[df['days_employed'] >= 0].count()

children            3445
days_employed       3445
dob_years           3445
education           3445
education_id        3445
family_status       3445
family_status_id    3445
gender              3445
income_type         3445
debt                3445
total_income        3445
purpose             3445
dtype: int64

In [42]:
# Filtrando os dados dos clientes desempregados
unemployed = df[df['income_type'] == 'unemployed']

# Exibindo as primeiras linhas
unemployed.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
3133,1,337524.466835,31,secondary education,1,married,0,M,unemployed,1,9593.119,buying property for renting out
14798,0,395302.838654,45,bachelor's degree,0,civil partnership,1,F,unemployed,0,32435.602,housing renovation

In [43]:
unemployed[unemployed['days_employed'] > 0].count()

children            2
days_employed       2
dob_years           2
education           2
education_id        2
family_status       2
family_status_id    2
gender              2
income_type         2
debt                2
total_income        2
purpose             2
dtype: int64

In [44]:
# Filtrando os dados dos aposentados
retirees = df[df['income_type'] == 'retiree']

# Exibindo as primeiras linhas
retirees.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
18,0,400281.136913,53,secondary education,1,widow / widower,2,F,retiree,0,9091.804,buying a second-hand car
24,1,338551.952911,57,secondary education,1,unmarried,4,F,retiree,0,46487.558,transactions with commercial real estate
25,0,363548.489348,67,secondary education,1,married,0,M,retiree,0,8818.041,buy real estate

In [45]:
retirees[retirees['days_employed'] > 0].count()

children            3443
days_employed       3443
dob_years           3443
education           3443
education_id        3443
family_status       3443
family_status_id    3443
gender              3443
income_type         3443
debt                3443
total_income        3443
purpose             3443
dtype: int64

In [46]:
total = retirees[retirees['days_employed'] > 0].count() + unemployed[unemployed['days_employed'] > 0].count()
print(total)

children            3445
days_employed       3445
dob_years           3445
education           3445
education_id        3445
family_status       3445
family_status_id    3445
gender              3445
income_type         3445
debt                3445
total_income        3445
purpose             3445
dtype: int64

<font face='Calibri' color="#001A56" size=+0.8>
Os dados positivos são dos clientes desempregados e aposentados, portanto concluo que houve um erro no imput de dados, provalvemente foram invertidas as datas de inicio e data final. Para esse problema iremos corrigir os valores negativos, substituindo por positivos.

Outro problema é a grandeza dos números, pois são números muito alto sendo incopativel até mesmo com a idade dos clientes, onde a quantidade de dias trabalhados era superior aos dias de vida do cliente. O ideal seria saber como essa métrica foi calculada para saber a causa raiz desse problema. Como isso não é possível vou considerar que seja um possível erro de digitação onde foi incluido duas casas decimais a mais na hora de digitar e para tratar isso irei dividir esses valores muito altos por 100, pois mesmo dividindo por 10 os valores peranecem muito altos.

In [47]:
# Eliminando os valores negativos
df['days_employed'] = abs(df['days_employed'])

In [48]:
# Função de divisão do dias empregrados.
def correct_days_employed(row):
    if row['days_employed']>row['dob_years']*365:
        return row['days_employed']/100
    else:
        return row['days_employed']

# Aplicando a função
df['days_employed'] = df.apply(correct_days_employed, axis=1)

# Exibindo as primeiras linhas da tabela
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,3402.660720,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding

<font face='Calibri' color="#001A56" size=+0.8>
Não possuímos mais valores negativos para a coluna <b>days_employed</b>, nem valores excessivamente altos.
    
    
[Voltar ao Índice](#back)

<a id='dob_years'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Analisando os dados da coluna dob_years.
</font></h3>
<p>
<font face='Calibri' color="#001A56" size=+0.8>

In [49]:
# Exibindo os números unívocos.
df['dob_years'].unique()

array([42, 36, 33, 32, 53, 27, 43, 50, 35, 41, 40, 65, 54, 56, 26, 48, 24,
       21, 57, 67, 28, 63, 62, 47, 34, 68, 25, 31, 30, 20, 49, 37, 45, 61,
       64, 44, 52, 46, 23, 38, 39, 51,  0, 59, 29, 60, 55, 58, 71, 22, 73,
       66, 69, 19, 72, 70, 74, 75], dtype=int64)

In [50]:
# Quantidade de clientes de cada idade.
df['dob_years'].value_counts()

35    617
40    609
41    607
34    603
38    598
42    597
33    581
39    573
31    560
36    555
44    547
29    545
30    540
48    538
37    537
50    514
43    513
32    510
49    508
28    503
45    497
27    493
56    487
52    484
47    480
54    479
46    475
58    461
57    460
53    459
51    448
59    444
55    443
26    408
60    377
25    357
61    355
62    352
63    269
64    265
24    264
23    254
65    194
22    183
66    183
67    167
21    111
0     101
68     99
69     85
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: dob_years, dtype: int64

<font face='Calibri' color="#001A56" size=+0.8>
Os únicos dados aparentemente incosistentes que encontramos foram as idades com valor 0. Ireemos substituir pela média de idade levando em consideração o gênero, não utilizaremos a mediana pois não temos valores atípicos significativos.

In [51]:
# Calculando a média de idade por gênero.
df.groupby('gender')['dob_years'].mean()

gender
F      44.471972
M      40.993825
XNA    24.000000
Name: dob_years, dtype: float64

In [52]:
# Função para correção de idade 0.
def correção_de_idade(row):
    if row['dob_years'] == 0:
        if row['gender'] == 'F':
            return 44
        elif row['gender'] == 'M':
            return 41
    else:
        return row['dob_years']

# Aplicando a função    
df['dob_years'] = df.apply(correção_de_idade, axis=1)

In [53]:
# Exibindo a nova contagem de idades.
df['dob_years'].value_counts()

41    636
44    619
35    617
40    609
34    603
38    598
42    597
33    581
39    573
31    560
36    555
29    545
30    540
48    538
37    537
50    514
43    513
32    510
49    508
28    503
45    497
27    493
56    487
52    484
47    480
54    479
46    475
58    461
57    460
53    459
51    448
59    444
55    443
26    408
60    377
25    357
61    355
62    352
63    269
64    265
24    264
23    254
65    194
22    183
66    183
67    167
21    111
68     99
69     85
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: dob_years, dtype: int64

<font face='Calibri' color="#001A56" size=+0.8>
As idade com valores iguais a 0 foram eliminadas, analisaremos agora a próxima coluna.
    
<br>

[Voltar ao Índice](#back)

<a id='family'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Analisando os dados da coluna family_status.
</font></h3>
<p>

In [54]:
# Checando os resultados unívocos.
df['family_status'].unique()

array(['married', 'civil partnership', 'widow / widower', 'divorced',
       'unmarried'], dtype=object)

In [55]:
# Contando os resultados de family_status.
df['family_status'].value_counts(normalize=True, ascending=False)

married              0.575145
civil partnership    0.194053
unmarried            0.130685
divorced             0.055517
widow / widower      0.044599
Name: family_status, dtype: float64

<font face='Calibri' color="#001A56" size=+0.8>
Não há problemas com os dados da coluna family_status, analisaremos agora a próxima coluna.
    
<br>

[Voltar ao Índice](#back)

<a id='gender'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Analisando os dados da coluna gender.
</font></h3>
<p>

In [56]:
# Verificando os valores unívocos da coluna gender.
df['gender'].unique()

array(['F', 'M', 'XNA'], dtype=object)

In [57]:
# Contado a quantidade de valores de cada gênero.
df['gender'].value_counts()

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

<font face='Calibri' color="#001A56" size=+0.8>
Não encontramos nenhum problema com os dados da coluna 'gender'. Unico dado que chamou atenção foi o valor 'XNA', iremos considerar que é alguém que não se identifica com os genêros Feminino e Masculino por esse motivo iremos manter da forma que está.
<br>

[Voltar ao Índice](#back)

<a id='income_type'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Analisando os dados da coluna income_type.
</font></h3>
<p>

In [58]:
# Verificando os valores unívocos da coluna income_type.
df['income_type'].unique()

array(['employee', 'retiree', 'business', 'civil servant', 'unemployed',
       'entrepreneur', 'student', 'paternity / maternity leave'],
      dtype=object)

In [59]:
# Contando os valores da coluna
df['income_type'].value_counts()

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
student                            1
paternity / maternity leave        1
Name: income_type, dtype: int64

<font face='Calibri' color="#001A56" size=+0.8>
Não encontreamos nenhum problema com os dados da coluna 'income_type'. Porém, iremos alterar 'entrepreneur' para 'business', pois são as mesmas atividades. Também iremos alterar os dados unemployed, student  e paternity / maternity leave, para others, pois são amostras muito pequenas diante da quantidade total de dados, mesmo somados esses dados representam apenas 0,01% do total.

In [60]:
# Função para alteração das atividades.
def correct_income_type(row):
    if row['income_type'] == 'entrepreneur':
        return 'business'
    if row['income_type'] == 'unemployed':
        return 'others'
    if row['income_type'] == 'student':
        return 'others'
    if row['income_type'] == 'paternity / maternity leave':
        return 'others'
    else:
        return row['income_type']

# Aplicando as funções.
df['income_type'] = df.apply(correct_income_type, axis=1)

# Contando os valores.
df['income_type'].value_counts(normalize=True)

employee         0.516562
business         0.236330
retiree          0.179141
civil servant    0.067782
others           0.000186
Name: income_type, dtype: float64

<font face='Calibri' color="#001A56" size=+0.8>
Os dados foram corrigidos, agora temos apenas 5 tipos diferentes de rendas. Verificaremos agora os dados duplicados.</font>
    

  
[Voltar ao Índice](#back)

<a id='duplicados'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Verificando a presença de dados duplicados.
</font></h3>
<p>

In [61]:
# Exibindo as informações dos dados.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [62]:
# Filtrando os dados duplicados.
duplicados = df[df.duplicated()]

# Exibindo as primeiras linhas dos dados duplicados.
duplicados.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
2849,0,NaN,41,secondary education,1,married,0,F,employee,0,NaN,purchase of the house for my family
3290,0,NaN,58,secondary education,1,civil partnership,1,F,retiree,0,NaN,to have a wedding
4182,1,NaN,34,bachelor's degree,0,civil partnership,1,F,employee,0,NaN,wedding ceremony
4851,0,NaN,60,secondary education,1,civil partnership,1,F,retiree,0,NaN,wedding ceremony
5557,0,NaN,58,secondary education,1,civil partnership,1,F,retiree,0,NaN,to have a wedding

In [63]:
duplicados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 71 entries, 2849 to 21415
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          71 non-null     int64
 1   days_employed     0 non-null      float64
 2   dob_years         71 non-null     int64
 3   education         71 non-null     object
 4   education_id      71 non-null     int64
 5   family_status     71 non-null     object
 6   family_status_id  71 non-null     int64
 7   gender            71 non-null     object
 8   income_type       71 non-null     object
 9   debt              71 non-null     int64
 10  total_income      0 non-null      float64
 11  purpose           71 non-null     object
dtypes: float64(2), int64(5), object(5)
memory usage: 7.2+ KB

In [64]:
duplicados.count() / df.count()

children            0.003298
days_employed       0.000000
dob_years           0.003298
education           0.003298
education_id        0.003298
family_status       0.003298
family_status_id    0.003298
gender              0.003298
income_type         0.003298
debt                0.003298
total_income        0.000000
purpose             0.003298
dtype: float64

<font face='Calibri' color="#001A56" size=+0.8>
O número de dados duplicados é 71 (0,32% do total). Iremos excluir esses dados duplicados pois são uma quantia pequena em relação ao total.

In [65]:
# Excluindo dados duplicados.
df = df.drop_duplicates().reset_index(drop=True)

# Exibindo informações dos dados.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21454 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21454 non-null  int64
 3   education         21454 non-null  object
 4   education_id      21454 non-null  int64
 5   family_status     21454 non-null  object
 6   family_status_id  21454 non-null  int64
 7   gender            21454 non-null  object
 8   income_type       21454 non-null  object
 9   debt              21454 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21454 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

<font face='Calibri' color="#001A56" size=+0.8>
Os dados foram eliminados, trataremos agora dos valores ausentes.</font>
    

  
[Voltar ao Índice](#back)

<a id='Tausentes'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Tratando os valores ausentes.
</font></h3>
<p>
    <font face='Calibri' color="#001A56" size=+0.8>
As colunas com valores ausentes são: <code>days_employed</code> e <code>total_income</code>.

Para decidir com qual valor serão preenchidos esses valores, primeiro irei verificar quais outras caracteristicas podem influenciar essas duas informações, encontrando essas caracteristicas que influência irei analisar o que é mais apropriado para cada caso, se utilizar a média ou mediana. Para isso, iremos classificar os clientes por idade e depois analisar apenas os dados que não possuem valores ausentes.

In [66]:
# Função para classificação por idade.
def faixa_etaria(row):
    if row['dob_years'] <= 20:
        return '0 - 20'
    elif row['dob_years'] <31:
        return '21 - 30'
    elif row['dob_years'] <41:
        return '31 - 40'
    elif row['dob_years'] <51:
        return '41 - 50'
    elif row['dob_years'] <61:
        return '51 - 60'
    else:
        return '+60'

In [67]:
# Testando a função.
faixa_etaria(df.iloc[0])

'41 - 50'

In [68]:
# Criando uma nova coluna e aplicando a função.
df['faixa_etaria'] = df.apply(faixa_etaria, axis=1)

# Exibindo as primeiras linhas.
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,faixa_etaria
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,41 - 50
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,31 - 40
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,31 - 40
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,31 - 40
4,0,3402.660720,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,51 - 60

In [69]:
# Contado os usuários conforme classificação.
df['faixa_etaria'].value_counts(normalize = True)

31 - 40    0.267176
41 - 50    0.249883
51 - 60    0.210590
21 - 30    0.170225
+60        0.099096
0 - 20     0.003030
Name: faixa_etaria, dtype: float64

In [70]:
# Filtrando os dados completos.
completos = df.dropna().reset_index(drop=True)

# Exibindo as primeiras linhas.
completos.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,faixa_etaria
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,41 - 50
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,31 - 40
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,31 - 40
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,31 - 40
4,0,3402.660720,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,51 - 60

In [71]:
# Exibindo a média dos dados agrupados por education.
completos.groupby('education')['total_income'].mean()

education
bachelor's degree      33142.802434
graduate degree        27960.024667
primary education      21144.882211
secondary education    24594.503037
some college           29045.443644
Name: total_income, dtype: float64

In [72]:
# Exibindo a mediana dos dados completos agrupados por education.
completos.groupby('education')['total_income'].median()

education
bachelor's degree      28054.5310
graduate degree        25161.5835
primary education      18741.9760
secondary education    21836.5830
some college           25618.4640
Name: total_income, dtype: float64

In [73]:
# Exibindo a contagem dos dados em education.
completos['education'].value_counts()

secondary education    13693
bachelor's degree       4716
some college             675
primary education        261
graduate degree            6
Name: education, dtype: int64

In [74]:
# Exibindo a média dos dados agrupados por faixa etária.
completos.groupby('faixa_etaria')['total_income'].mean()

faixa_etaria
+60        23057.777452
0 - 20     19586.303559
21 - 30    25928.848368
31 - 40    28376.735148
41 - 50    28332.806009
51 - 60    25482.856294
Name: total_income, dtype: float64

In [75]:
# Exibindo a mediana dos dados agrupados por faixa etária.
completos.groupby('faixa_etaria')['total_income'].median()

faixa_etaria
+60        19637.0560
0 - 20     17257.2770
21 - 30    23079.3820
31 - 40    24825.1865
41 - 50    24563.6500
51 - 60    22056.7710
Name: total_income, dtype: float64

In [76]:
# Exibindo a média dos dados agrupados por status familiar.
completos.groupby('family_status')['total_income'].mean()

family_status
civil partnership    26694.428597
divorced             27189.354550
married              27041.784689
unmarried            26934.069805
widow / widower      22984.208556
Name: total_income, dtype: float64

In [77]:
# Exibindo a mediana dos dados agrupados por status familiar.
completos.groupby('family_status')['total_income'].median()

family_status
civil partnership    23186.534
divorced             23515.096
married              23389.540
unmarried            23149.028
widow / widower      20514.190
Name: total_income, dtype: float64

In [78]:
# Exibindo a média dos dados agrupados por gênero.
completos.groupby('gender')['total_income'].mean()

gender
F      24655.604757
M      30907.144369
XNA    32624.825000
Name: total_income, dtype: float64

In [79]:
# Exibindo a mediana dos dados agrupados por gênero.
completos.groupby('gender')['total_income'].median()

gender
F      21464.845
M      26834.295
XNA    32624.825
Name: total_income, dtype: float64

In [80]:
# Exibindo a média dos dados agrupados por tipo de renda.
completos.groupby('income_type')['total_income'].mean()

income_type
business         32397.165026
civil servant    27343.729582
employee         25820.841683
others           16588.410500
retiree          21940.394503
Name: total_income, dtype: float64

In [81]:
# Exibindo a mediana dos dados agrupados por tipo de renda.
completos.groupby('income_type')['total_income'].median()

income_type
business         27583.3600
civil servant    24071.6695
employee         22815.1035
others           12652.6895
retiree          18962.3180
Name: total_income, dtype: float64

In [82]:
# Exibindo a média dos dados agrupados por status familiar.
completos.groupby('family_status')['total_income'].mean()

family_status
civil partnership    26694.428597
divorced             27189.354550
married              27041.784689
unmarried            26934.069805
widow / widower      22984.208556
Name: total_income, dtype: float64

In [83]:
# Exibindo a mediana dos dados agrupados por status familiar.
completos.groupby('family_status')['total_income'].median()

family_status
civil partnership    23186.534
divorced             23515.096
married              23389.540
unmarried            23149.028
widow / widower      20514.190
Name: total_income, dtype: float64

In [84]:
# Exibindo a média dos dados agrupados por quantidade de crianças.
completos.groupby('children')['total_income'].mean()

children
0    26422.404866
1    27368.627863
2    27478.854282
3    29322.623993
4    27289.829647
5    27268.847250
Name: total_income, dtype: float64

In [85]:
# Exibindo a mediana dos dados agrupados por quantidade de crianças.
completos.groupby('children')['total_income'].median()

children
0    23029.9535
1    23660.5630
2    23136.1155
3    25155.4480
4    24981.6340
5    29816.2255
Name: total_income, dtype: float64

<font face='Calibri' color="#001A56" size=+0.8>
Levamos em consideração todas as caracteristicas que por ventura possam de algum formar interferir na renda do índíviduo. Os que mais apresentaram váriação foram: Educação e ocupação, portanto usarei essas caracteristicas para definir os valores que serão utilizados para preencher os dados faltantes, utilizaremos as medianas pois é comun encontrar valores atipicos de renda entre pessoas com diferentes profissões e graus de escolaridade.

Também iremos corrigir as categorias da coluna educação, alterando bachelor's degree e graduate degree para some college, para que não fiquem amostras muito pequenas e também por serem informações muito semelhantes.

In [86]:
# Calculando a mediana
completos.groupby(['education', 'income_type'])['total_income'].median()

education            income_type
bachelor's degree    business         32300.7300
                     civil servant    27601.7775
                     employee         26502.5190
                     others           24073.9310
                     retiree          23078.5230
graduate degree      civil servant    17822.7570
                     employee         31771.3210
                     retiree          28334.2150
primary education    business         21887.8250
                     civil servant    23734.2870
                     employee         20159.1860
                     retiree          16415.7850
secondary education  business         25451.3100
                     civil servant    21864.4750
                     employee         21848.8175
                     others            9102.8900
                     retiree          18374.8570
some college         business         28778.7440
                     civil servant    25694.7750
                     employee         24209.4300
                     retiree          19221.9030
Name: total_income, dtype: float64

In [87]:
# Aplicando a mediana para completar os valores ausentes.
df['total_income'] = df['total_income'].fillna(df.groupby(['education', 'income_type'])['total_income'].transform('median'))

# Exibindo as primeiras linhas.
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,faixa_etaria
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,41 - 50
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,31 - 40
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,31 - 40
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,31 - 40
4,0,3402.660720,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,51 - 60

In [88]:
# Checando a quantidade de valores ausentes.
df['total_income'].isna().sum()

0

In [89]:
# Exibindo as informações do DataFrame.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21454 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21454 non-null  int64
 3   education         21454 non-null  object
 4   education_id      21454 non-null  int64
 5   family_status     21454 non-null  object
 6   family_status_id  21454 non-null  int64
 7   gender            21454 non-null  object
 8   income_type       21454 non-null  object
 9   debt              21454 non-null  int64
 10  total_income      21454 non-null  float64
 11  purpose           21454 non-null  object
 12  faixa_etaria      21454 non-null  object
dtypes: float64(2), int64(5), object(6)
memory usage: 2.1+ MB

<font face='Calibri' color="#001A56" size=+0.8>
Os valores ausentes em <b>total_income</b> foram preenchidos, trataremos agora dos valores ausentes em <b>days_employed</b>

In [90]:
# Exibindo a media de days_employed por faixa etaria e education.
df.groupby(['faixa_etaria', 'education'])['days_employed'].mean()

faixa_etaria  education
+60           bachelor's degree      3892.685842
              graduate degree        3569.305175
              primary education      3668.410832
              secondary education    3655.598692
              some college           3692.325292
0 - 20        bachelor's degree       612.671321
              secondary education     662.012702
              some college            755.821207
21 - 30       bachelor's degree      1301.704617
              primary education      1144.210723
              secondary education    1326.427736
              some college           1085.780728
31 - 40       bachelor's degree      2112.041380
              graduate degree        4159.753909
              primary education      1954.419571
              secondary education    2125.439918
              some college           1662.684701
41 - 50       bachelor's degree      2746.677964
              graduate degree         409.200149
              primary education      1837.067860
              secondary education    2840.296908
              some college           2536.709083
51 - 60       bachelor's degree      3451.375754
              graduate degree        5352.038180
              primary education      3396.273740
              secondary education    3458.266831
              some college           2848.086201
Name: days_employed, dtype: float64

In [91]:
# Exibindo a mediana de days_employed por faixa etaria e education.
df.groupby(['faixa_etaria', 'education'])['days_employed'].median()

faixa_etaria  education
+60           bachelor's degree      3649.448997
              graduate degree        3569.305175
              primary education      3638.075315
              secondary education    3631.221820
              some college           3587.324754
0 - 20        bachelor's degree       592.068159
              secondary education     685.687432
              some college            796.983636
21 - 30       bachelor's degree      1084.094015
              primary education       949.705772
              secondary education    1090.010820
              some college            891.699189
31 - 40       bachelor's degree      1645.805469
              graduate degree        4159.753909
              primary education      1290.149755
              secondary education    1667.330899
              some college           1245.013118
41 - 50       bachelor's degree      2094.889867
              graduate degree         409.200149
              primary education      1066.040399
              secondary education    2203.078545
              some college           2100.473217
51 - 60       bachelor's degree      3442.268744
              graduate degree        5352.038180
              primary education      3491.876613
              secondary education    3485.964744
              some college           2992.151849
Name: days_employed, dtype: float64

<font face='Calibri' color="#001A56" size=+0.8>
Utilizaremos a mediana devido a presença de valores atipicos. Por exemplo, a diferença de dias empregados entre uma pessoa com 20 anos de idade pode ser muito diferente de uma pessoa de 50 anos de idade. O mesmo podemos inferir de uma pessoa que concluiu apenas o ensino primário de outra que concluiu alguma faculdade, pois quem completou apenas o ensino primário provavelmente começou a trabalhar mais jovem.

In [92]:
df.pivot_table(index='faixa_etaria', columns='education', values='days_employed', aggfunc='median').style.background_gradient(cmap = 'Blues')

<font face='Calibri' color="#001A56" size=+0.8>
Como é possível observar na tabela acima, temos diferentes medianas de 'days_employed' para diferentes grupos de 'education' e 'faixa_etaria', por esse motivo irei agrupar os dados segundo essas variáveis. A utilização da mediana se deve a possível presença de valores atípicos que podem distorcer a média.

In [94]:
# Preenchendo dados ausentes em days_employed.
df['days_employed'] = df['days_employed'].fillna(
    df.groupby(['faixa_etaria','education'])['days_employed'].transform('median'))

# Exibindo as primeiras linhas da tabela.
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,faixa_etaria
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,41 - 50
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,31 - 40
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,31 - 40
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,31 - 40
4,0,3402.660720,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,51 - 60

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21454 non-null  int64
 1   days_employed     21454 non-null  float64
 2   dob_years         21454 non-null  int64
 3   education         21454 non-null  object
 4   education_id      21454 non-null  int64
 5   family_status     21454 non-null  object
 6   family_status_id  21454 non-null  int64
 7   gender            21454 non-null  object
 8   income_type       21454 non-null  object
 9   debt              21454 non-null  int64
 10  total_income      21454 non-null  float64
 11  purpose           21454 non-null  object
 12  faixa_etaria      21454 non-null  object
dtypes: float64(2), int64(5), object(6)
memory usage: 2.1+ MB

<font face='Calibri' color="#001A56" size=+0.8>
Como podemos observar, os valores ausentes foram preenchidos.</font>
    
    
    

[Voltar ao Índice](#back)

<a id='categorias'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Categorização de dados
</font></h3>
<p>
    <font face='Calibri' color="#001A56" size=+0.8>
Iremos categorizar os dados da coluna <b>purpose</b>, e da coluna <b>total_income</b>. A coluna <b>purpose</b> traz diferentes descrições para o mesmo objetivo de empréstimo, por esse motivo iremos categorizar de forma mais clara e concisa. A coluna <b>total_income</b> também será categorizada pois as hipóteses trazem perguntas relacionadas ao nível de renda, da forma que os dados estão dísponíveis é muito dificil ter a visibilidade por nível, por esse motivo serão categorizados.

In [96]:
# Contando os valores da coluna purpose.
df['purpose'].value_counts()

wedding ceremony                            791
having a wedding                            768
to have a wedding                           765
real estate transactions                    675
buy commercial real estate                  661
housing transactions                        652
buying property for renting out             651
transactions with commercial real estate    650
purchase of the house                       646
housing                                     646
purchase of the house for my family         638
construction of own property                635
property                                    633
transactions with my real estate            627
building a real estate                      624
buy real estate                             621
purchase of my own house                    620
building a property                         619
housing renovation                          607
buy residential real estate                 606
buying my own car                           505
going to university                         496
car                                         494
second-hand car purchase                    486
to own a car                                478
buying a second-hand car                    478
cars                                        478
to buy a car                                471
car purchase                                461
supplementary education                     460
purchase of a car                           455
university education                        452
education                                   447
to get a supplementary education            446
getting an education                        442
profile education                           436
getting higher education                    426
to become educated                          408
Name: purpose, dtype: int64

In [97]:
# Verificando os valores unicos da coluna purpose.
df['purpose'].unique()

array(['purchase of the house', 'car purchase', 'supplementary education',
       'to have a wedding', 'housing transactions', 'education',
       'having a wedding', 'purchase of the house for my family',
       'buy real estate', 'buy commercial real estate',
       'buy residential real estate', 'construction of own property',
       'property', 'building a property', 'buying a second-hand car',
       'buying my own car', 'transactions with commercial real estate',
       'building a real estate', 'housing',
       'transactions with my real estate', 'cars', 'to become educated',
       'second-hand car purchase', 'getting an education', 'car',
       'wedding ceremony', 'to get a supplementary education',
       'purchase of my own house', 'real estate transactions',
       'getting higher education', 'to own a car', 'purchase of a car',
       'profile education', 'university education',
       'buying property for renting out', 'to buy a car',
       'housing renovation', 'going to university'], dtype=object)

In [98]:
# Selecionando as descrições e conversões.
conversão = { 'wedding ceremony' : 'casamento',
            'having a wedding' : 'casamento',
            'to have a wedding' : 'casamento',
            'buying my own car' : 'automóvel',
            'car':'automóvel',
            'second-hand car purchase':'automóvel',
            'to own a car':'automóvel',
            'buying a second-hand car':'automóvel',
            'cars':'automóvel',
            'to buy a car':'automóvel',
            'car purchase':'automóvel',
            'purchase of a car':'automóvel',
            'going to university':'educação',
            'supplementary education':'educação',
            'university education':'educação',
            'to get a supplementary education':'educação',
            'education':'educação',
            'getting an education':'educação',
            'profile education':'educação',
            'getting higher education':'educação',
            'to become educated':'educação',
            'real estate transactions':'imóveis',
            'buy commercial real estate':'imóveis',
            'buying property for renting out':'imóveis',
            'housing transactions':'imóveis',
            'transactions with commercial real estate':'imóveis',
            'housing':'imóveis',
            'purchase of the house':'imóveis',
            'purchase of the house for my family ':'imóveis',
            'construction of own property':'imóveis',
            'property':'imóveis',
            'transactions with my real estate':'imóveis',
            'building a real estate':'imóveis',
            'buy real estate':'imóveis',
            'building a property':'imóveis',
            'purchase of my own house':'imóveis',
            'housing renovation':'imóveis',
            'buy residential real estate':'imóveis',
            'buying my own car':'imóveis',
}


# Alocando as novas descrições na coluna objetivo.
df['objetivo'] = df['purpose'].map(conversão)

# Exibindo as primeiras linhas da tabela.
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,faixa_etaria,objetivo
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,41 - 50,imóveis
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,31 - 40,automóvel
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,31 - 40,imóveis
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,31 - 40,educação
4,0,3402.660720,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,51 - 60,casamento

<font face='Calibri' color="#001A56" size=+0.8>
A categorização conforme o objetivo do empréstimo foi realizada e alocada na coluna <b>objetivo</b>, agora iremos realizar a categorização pela renda total, iremos utilizar os seguintes intervalos:
<ul>
<li>Abaixo de 15.000.
<li>15.000 - 19.999.
<li>20.000 - 24.999.
<li>25.000 - 29.999.
<li>30.000 - 34.999.
<li>Acima de 35.000.
</ul>    
Os intervalos foram definidos dessa forma para que os grupos ficassem com tamanhos parecidos. E que não ficassem com muitos intervalos.

In [99]:
df['total_income'].describe()

count     21454.000000
mean      26470.476968
std       15722.057710
min        3306.762000
25%       17202.553250
50%       22993.274000
75%       31729.172000
max      362496.645000
Name: total_income, dtype: float64

In [100]:
# Função para categorização de dados.
def niveis_de_renda(row):
    if row['total_income'] < 15000:
        return 'abaixo de 15.000'    
    if row['total_income'] < 20000:
        return '15.000 - 19.999'
    if row['total_income'] < 25000:
        return '20.000 - 24.999'
    if row['total_income'] < 30000:
        return '25.000 - 29.999'
    if row['total_income'] < 35000:
        return '30.000 - 34.999'
    if row['total_income'] >= 35000:
        return 'acima de 35.000'
    
# Testando função
niveis_de_renda(df.iloc[0])

'acima de 35.000'

In [101]:
# Aplicando função em uma nova coluna.
df['nivel_de_renda'] = df.apply(niveis_de_renda, axis=1)

#Exibindo as primeiras linhas da coluna.
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,faixa_etaria,objetivo,nivel_de_renda
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,41 - 50,imóveis,acima de 35.000
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,31 - 40,automóvel,15.000 - 19.999
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,31 - 40,imóveis,20.000 - 24.999
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,31 - 40,educação,acima de 35.000
4,0,3402.660720,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,51 - 60,casamento,25.000 - 29.999

In [102]:
# Contado os valores em cada categoria.
df['nivel_de_renda'].value_counts()

20.000 - 24.999     4352
acima de 35.000     4068
15.000 - 19.999     3957
abaixo de 15.000    3743
25.000 - 29.999     3296
30.000 - 34.999     2038
Name: nivel_de_renda, dtype: int64

<font face='Calibri' color="#001A56" size=+0.8>
    Os dados foram distribuidos entre as categorias, agora iremos verificar nossas hipóteses.</font>
        
    
    

[Voltar ao Índice](#back)

<a id='hypotheses'></a>
<h2><font face='Calibri' color="#001A56" size=+3.0>
Etapa 3. Verificando hipóteses
    </font></h2>
    <p>
    
<a id='h1'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Hipótese 1: Existe uma correlação entre o nível de renda e do pagamento em dia?
    </font></h3>

In [103]:
# Proporção dos clientes que deixaram de pagar empréstimos.
df['debt'].value_counts(normalize=True)

0    0.91885
1    0.08115
Name: debt, dtype: float64

In [104]:
# Contagem dos clientes em cada nível de renda.
df['nivel_de_renda'].value_counts()

20.000 - 24.999     4352
acima de 35.000     4068
15.000 - 19.999     3957
abaixo de 15.000    3743
25.000 - 29.999     3296
30.000 - 34.999     2038
Name: nivel_de_renda, dtype: int64

In [105]:
# Proporções agrupando por nível de renda.
df.groupby('nivel_de_renda')['debt'].value_counts(normalize=True)

nivel_de_renda    debt
15.000 - 19.999   0       0.914076
                  1       0.085924
20.000 - 24.999   0       0.911305
                  1       0.088695
25.000 - 29.999   0       0.917172
                  1       0.082828
30.000 - 34.999   0       0.924436
                  1       0.075564
abaixo de 15.000  0       0.920385
                  1       0.079615
acima de 35.000   0       0.928712
                  1       0.071288
Name: debt, dtype: float64

In [106]:
# Proporção do total de clientes;
df.groupby('nivel_de_renda')['debt'].sum() / df['nivel_de_renda'].count()

nivel_de_renda
15.000 - 19.999     0.015848
20.000 - 24.999     0.017992
25.000 - 29.999     0.012725
30.000 - 34.999     0.007178
abaixo de 15.000    0.013890
acima de 35.000     0.013517
Name: debt, dtype: float64

<a id='h1_conclusao'></a>
<h4><font face='Calibri' color="#1E90B6" size=+2.0>
Conclusões
</font></h4>
    <p>
<font face='Calibri' color="#001A56" size=+0.8>
Não existe relação direta entre o nível de renda e o pagamento em dia, o grupo de pessoas com renda entre 20.000 e 24.999 são os mais inadimplentes com uma taxa de 8,86%, e também podemos observar que a partir desse grupo quanto maior o nível de renda menor a taxa de inadimplência.
    
[Voltar ao Índice](#back)

<a id='h1'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
Hipótese 1: Existe uma correlação entre o status familiar e o pagamento em dia?
    </font></h3>

In [108]:
# Contagem dos clientes de cada status familiar.
df['family_status'].value_counts()

married              12339
civil partnership     4151
unmarried             2810
divorced              1195
widow / widower        959
Name: family_status, dtype: int64

In [109]:
# Contagem de inadimplentes por status familiar.
df.groupby('family_status')['debt'].value_counts(normalize=False)

family_status      debt
civil partnership  0        3763
                   1         388
divorced           0        1110
                   1          85
married            0       11408
                   1         931
unmarried          0        2536
                   1         274
widow / widower    0         896
                   1          63
Name: debt, dtype: int64

In [110]:
# Proporções de inadimplentes agrupado por status familiar.
df.groupby('family_status')['debt'].value_counts(normalize=True)

family_status      debt
civil partnership  0       0.906529
                   1       0.093471
divorced           0       0.928870
                   1       0.071130
married            0       0.924548
                   1       0.075452
unmarried          0       0.902491
                   1       0.097509
widow / widower    0       0.934307
                   1       0.065693
Name: debt, dtype: float64

In [111]:
# Proporção do total de clientes.
df.groupby('family_status')['debt'].sum() / df['nivel_de_renda'].count()

family_status
civil partnership    0.018085
divorced             0.003962
married              0.043395
unmarried            0.012772
widow / widower      0.002937
Name: debt, dtype: float64

<a id='h2_conclusao'></a>
<h4><font face='Calibri' color="#1E90B6" size=+2.0>
Conclusões
</font></h4>
    <p>
<font face='Calibri' color="#001A56" size=+0.8>
Quando observamos apenas a distribuição dos inadimplentes temos a impressão que pessoas que são casadas ou vivem com alguém tendem a ser mais inadimplentes, porém quando analisamos a taxa de inadimplência dentro de cada grupo do status familiar vemos que essa tendência não existe, ou seja não há relação entre o status familiar e o pagamento em dia. Porém também podemos concluir que alguns grupos são mais inadimplentes que outros como solteiros e pessoas que vivem juntos (civil partnership).
    
[Voltar ao Índice](#back)

<a id='h3'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
    Hipótese 3: Existe uma correlação entre o número de crianças e o pagamento em dia?
  </font></h3>
<p>

In [112]:
# Contagem dos clientes conforme a quantidade de filhos.
df['children'].value_counts()

0    14091
1     4855
2     2128
3      330
4       41
5        9
Name: children, dtype: int64

In [113]:
# Distribuição conforme quantidade de filhos e inadimplência.
df.groupby('children')['debt'].value_counts(normalize=False)

children  debt
0         0       13028
          1        1063
1         0        4410
          1         445
2         0        1926
          1         202
3         0         303
          1          27
4         0          37
          1           4
5         0           9
Name: debt, dtype: int64

In [114]:
# Proporção de inadimplência conforme quantidade de filhos.
df.groupby('children')['debt'].value_counts(normalize=True)

children  debt
0         0       0.924562
          1       0.075438
1         0       0.908342
          1       0.091658
2         0       0.905075
          1       0.094925
3         0       0.918182
          1       0.081818
4         0       0.902439
          1       0.097561
5         0       1.000000
Name: debt, dtype: float64

In [115]:
# Proporção do totalde clientes.
df.groupby('children')['debt'].sum() / df['nivel_de_renda'].count()

children
0    0.049548
1    0.020742
2    0.009415
3    0.001259
4    0.000186
5    0.000000
Name: debt, dtype: float64

<a id='h3_conclusao'></a>
<h4><font face='Calibri' color="#1E90B6" size=+2.0>
Conclusões
</font></h4>
    <p>
<font face='Calibri' color="#001A56" size=+0.8>
Analisando os dados de forma global somos levados a concluir que quanto maior o número de crianças menor a taxa de inadimplência dos clientes, porém devemos levar em consideração também o tamanho dos grupos, o que não nos permite chegar a essa conclusão. Quando observamos a taxa de inadimplência em cada grupo com diferente quantidade de crianças, concluímos que não há relação entre eles.
    
[Voltar ao Índice](#back)

<a id='h4'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
    Hipótese 4: Como a finalidade do crédito afeta a taxa de inadimplência?
  </font></h3>
<p>

In [116]:
# Distribuição de inadimplência agrupada por objetivo.
df.groupby('objetivo')['debt'].value_counts(normalize=False)

objetivo   debt
automóvel  0       3444
           1        357
casamento  0       2138
           1        186
educação   0       3643
           1        370
imóveis    0       9895
           1        783
Name: debt, dtype: int64

In [117]:
# Proporção de inadimplência agrupada por objetivo.
df.groupby('objetivo')['debt'].value_counts(normalize=True)

objetivo   debt
automóvel  0       0.906077
           1       0.093923
casamento  0       0.919966
           1       0.080034
educação   0       0.907800
           1       0.092200
imóveis    0       0.926672
           1       0.073328
Name: debt, dtype: float64

In [118]:
# Proporção sobre o total de clientes.
df.groupby('objetivo')['debt'].sum() / df['nivel_de_renda'].count()

objetivo
automóvel    0.016640
casamento    0.008670
educação     0.017246
imóveis      0.036497
Name: debt, dtype: float64

<a id='h4_conclusao'></a>
<h4><font face='Calibri' color="#1E90B6" size=+2.0>
Conclusões
</font></h4>
    <p>
<font face='Calibri' color="#001A56" size=+0.8>
As finalidades de crédito com maior taxa de inadimplência são aquelas ligadas à compra de automóveis e educação, enquanto aquelas ligada a casamento e a imóveis são as menores taxas, embora as solicitações de crédito para imóveis seja a mais recorrente.
    
[Voltar ao Índice](#back)

<a id='h5'></a>
<h3><font face='Calibri' color="#013294" size=+2.0>
    Hipótese 5: Existe uma correlação entre a educação e o pagamento em dia?
  </font></h3>
<p>

In [119]:
# Distribuição de inadimplência agrupada por grau de educação.
df.groupby('education')['debt'].value_counts(normalize=False)

education            debt
bachelor's degree    0        4972
                     1         278
graduate degree      0           6
primary education    0         251
                     1          31
secondary education  0       13808
                     1        1364
some college         0         676
                     1          68
Name: debt, dtype: int64

In [120]:
# Proporção de inadimplência agrupada por grau de educação.
df.groupby('education')['debt'].value_counts(normalize=True)

education            debt
bachelor's degree    0       0.947048
                     1       0.052952
graduate degree      0       1.000000
primary education    0       0.890071
                     1       0.109929
secondary education  0       0.910098
                     1       0.089902
some college         0       0.908602
                     1       0.091398
Name: debt, dtype: float64

In [121]:
# Proporção sobre o total de clientes.
df.groupby('education')['debt'].sum() / df['nivel_de_renda'].count()

education
bachelor's degree      0.012958
graduate degree        0.000000
primary education      0.001445
secondary education    0.063578
some college           0.003170
Name: debt, dtype: float64

<a id='h5_conclusao'></a>
<h4><font face='Calibri' color="#1E90B6" size=+2.0>
Conclusões
</font></h4>
    <p>
<font face='Calibri' color="#001A56" size=+0.8>
Na educação podemos observar uma relação com a inadimplência, quanto maior o grau de de educação menor a taxa de inadimplência.
    
[Voltar ao Índice](#back)

<a id='end'></a>
<h2><font face='Calibri' color="#001A56" size=+3.0>
Conclusão
     </font></h2>
    <p>
    
<font face='Calibri' color="#001A56" size=+0.8>
Inicialmente encontramos valores ausentes em duas colunas, <b>total_income</b> e <b>days_employed</b>, que foram preenchidos. Para preencher os valores ausentes de <b>total_income</b> calculamos a médiana da renda total dos demais clientes levando em consideração a ocupação e o nível de educação. Para preencher os valores ausentes de <b>days_employed</b> calculamos a mediana dos dias empregado dos demais clientes levando em consideração a faixa etária e o nível de educação. Para ambos foi utilizado a mediana pois existe a possibilidade de valores atípicos em ambos casos.

Quanto aos valores duplicados, realizamos a exclusão por representar uma pequena quantidade(0,32% do total).

Na coluna <b>education</b> encontramos a mesma informação escrita de formas diferentes (escritras em maiúsculas e minúsculas), então alteramos todas para minúsculas para que não houvesse divisão do mesmo grupo de dados.

Na coluna <b>children</b> encontramos números negativos onde provavelmente trata-se de um erro de digitação, o mesmo foi corrigido retirando o sinal negativo(-). Também nessa coluna encontramos um número muito alto (20), o que provavelmente trata-se de um erro de digitação, alterado para 2.

Na coluna <b>days_employed</b> verificamos a presença de números positivos e negativos, os dados positivos são dos clientes desempregados e aposentados, portanto consideramos um erro no imput de dados, provalvemente foram invertidas as datas de inicio e data final. Para esse problema corrigimos os valores negativos, substituindo por positivos. Também nessa coluna encontramos valores extremamente altos, sendo a quantidade de dias mais alta que a própria idade do cliente, nesse casso realizamos a divisão do número por 100, por acreditar que tenha sido um erro de digitação (acrescimo de zeros).

Encontramos na coluna <b>dob_years</b> idades com valor igual a 0. Substituimos pela média de idade levando em consideração o gênero, não utilizamos a mediana pois aparentemente não temos valores atípicos nessa característica.

Na coluna <b>income_type</b> não detectamos nenhum erro, mas realizamos algumas aterações. Alteramos <i>"entrepreneur"</i> para <i>"business"</i>, pois são as mesmas atividades e também <i>"unemployed"</i>, <i>"student"</i> e <i>"paternity / maternity leave"<i>, para <i>"others"<i>, pois são amostras muito pequenas.

Criamos algumas colunas para categorização de dados para que facilitasse a análise e manipução de dados, foram:
<ul>
<li><b>faixa etária</b>: utilizada para calcular as médias e medianas que preencheram valores ausentes.
<li><b>objetivo</b>: utizado para descrever a finalidade da solicitação do empréstimo de forma clara e consisa.
<li><b>nível de renda</b>: utilizada para facilitar a analise da relação entre renda e inadimplência.
</ul>
Após tudo isso, concluímos que:
<ol>
<b><li>Existe uma correlação entre o nível de renda e o pagamento em dia?</b> Não, porém pessoas com renda entre 20.000 e 24.999 são os mais inadimplentes com uma taxa de 8,79%. A partir de 25.000, quanto maior for a renda menos será a taxa de inadimplência.
<b><li>Existe uma correlação entre o status familiar e o pagamento em dia?</b> Não, mas solteiros e pessoas em união estável (civil partnership) tendem a ser mais inadimplentes em relação as outras com status familiar diferente desses.
<b><li>Existe uma correlação entre a quantidade de crianças e o pagamento em dia?</b> Não, mas podemos observar que aqueles que não tem crianças tem menores taxas de inadimplência.
<b><li>Como a finalidade do crédito afeta a taxa de inadimplência?</b> As finalidades de crédito com maior taxa de inadimplência são aquelas ligadas à compra de automóveis e educação, enquanto aquelas ligada a casamento e a imóveis são as menores taxas, embora as solicitações de crédito para imóveis seja a mais recorrente.
<b><li>Existe uma correlação entre a educação e o pagamento em dia?</b> Sim, quanto menor o grau de educação dos clientes maior a taxa de inadimplência.
</ol>    

[Voltar ao Índice](#back) 
    <p>
<hr>

<a id='fontes'></a>
<h2><font face='Calibri' color="#001A56" size=+3.0>
Fontes
     </font></h2>
    <p>
    
<font face='Calibri' color="#001A56" size=+0.8>
<ul>
<li> Documentação da biblioteca <a href="https://pandas.pydata.org/docs/" target="_blank">Pandas.

<a id='contato'></a>
<h2><font face='Calibri' color="#001A56" size=+3.0>
Contatos
     </font></h2>
    <p>
<font face='Calibri' color="#001A56" size=+0.8>
    <ul>
    <li><b>Autor:</b> Maycon Douglas dos Santos
    <p>    
    <li><b>E-mail:</b> mayconds13@live.com
    <p>  
    <li><b>LinkedIn:</b> <a href="https://www.linkedin.com/in/maycondouglasdossantos/"> linkedin.com/in/maycondouglasdossantos </a>
    <p>    
    <li><b>GitHub:</b> <a href="https://github.com/mayconddsantos"> github.com/mayconddsantos </a>
    <p>    
    <li><b>Repositório deste projeto:</b><a href="https://github.com/mayconddsantos/Projetos_Practicum"> github.com/mayconddsantos/Projetos_Practicum </a>